tutorials/shearStressDriven/successor/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType          RAS;

RAS
{
    RASModel            kEpsilon;
    //RASModel            kOmegaSST;

    turbulence          on;

    printCoeffs         on;

    kEpsilonCoeffs     // Valid only for epsilon-based models
    {
        Cmu         0.09;
        C1          1.44;
        C2          1.92;

        // For kappa=0.4
        sigmaEps    1.11;
    }
}

// ************************************************************************* //
